{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Burger",
    "1": "Donut",
    "2": "French Fries",
    "3": "Fried Chicken",
    "4": "Hot Dog",
    "5": "Pizza",
    "6": "Rost Potatoes",
    "7": "Sandwiches"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Burger": "0",
    "Donut": "1",
    "French Fries": "2",
    "Fried Chicken": "3",
    "Hot Dog": "4",
    "Pizza": "5",
    "Rost Potatoes": "6",
    "Sandwiches": "7"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.27.1"
}
